# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8n with Bipolar Cross-Check & Contour Anchor (BCCA)

# Parameters
nc: 80  # 类别数
scales: # YOLOv8n 缩放系数
  n: [0.33, 0.25, 1024]

# 0-P1/2: 第一层直接进行 4 通道审计与融合
# 这里的 64 是输出通道数，2 是步长（下采样）
backbone:
  # [from, repeats, module, args]
  - [-1, 1, CBAMFusion, [64, 3, 2]]  # c2=64, k=3, s=2
  - [-1, 1, Conv, [128, 3, 2]]      # c2=128, k=3, s=2 (P2/4)
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]      # c2=256, k=3, s=2 (P3/8)
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]      # c2=512, k=3, s=2 (P4/16)
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]     # c2=1024, k=3, s=2 (P5/32)
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

# YOLOv8 Head (保持不变，负责特征聚合与检测)
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # 融合 P4
  - [-1, 3, C2f, [512]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # 融合 P3
  - [-1, 3, C2f, [256]]  # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # 再次融合 P4
  - [-1, 3, C2f, [512]]  # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # 再次融合 P5
  - [-1, 3, C2f, [1024]]  # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)